package junkCode;
class ChouXiang{
	private String name;
	private String motto;
	ChouXiang(String name,String motto){
		 this.name=name;
		this.motto=motto;
	}
	public void say() {
		System.out.println("My name is: "+this.name+"\n"+"My motto is: "+this.motto);
	}
}
class SunXiaoChuan extends ChouXiang{
	public SunXiaoChuan(String name,String motto) {
		super(name,motto);
	}
	public void beiShengJing() {
		System.out.println("那真的牛皮，啊，那真的牛皮\n开会司马脸，上班司马脸，你是不***啊这种人，开会司马脸，上班司马脸，\n是不是要对着你妈遗像一直笑你才觉得有节目效果吗？\n惹你的妈了，那个人累了，不作表情是司马脸吗？一本正经是司马脸吗？\n开会那么严肃的时候，我要笑吗？对着你妈的遗像笑吧，\n傻逼一样的，回去参加你妈的灵堂吧，\n像他妈个弱智一样，司马脸，我死你妈卖孩\n，对了吧，我是你哥哥，我们俩个都是你妈的儿子,\nnmsl，好把。****哦，弱智，司马脸，****卖孩，司马脸\n要怎么摆吗？是不是要夹根筷子在嘴里，老子也学那个空姐空少一样的那种24小时的微笑吗？\n司马脸，****，你妈卖孩，滚去吃屎吧，**一样的，\n不会发弹幕不要发，日你的温哦，弱智一样的，什么是司马脸吗？\n***了我就摆一副臭脸，是不是司马脸吗？\n***，弱智一样，天天说司马脸，我要怎么样嘛？\n发脾气司马脸，不发脾气在那打游戏也是司马脸，那要做什么表情给你吗？\n你要我哭才不是司马脸吗？对不起，做不到，你要我一直笑吗，对不起，我也做不到，\n所以说很正常，我就这副脸啊，司马脸，像***哈皮。\n(叮咚)啊哼，不要扣b，啊不要在这扣b， 你们要扣b去二台扣，我们这不扣b的，文明直播间，扣锤子b。\n啊肯，鼻子堵着了，很鸡儿难受。啊肯，\n对，***了，我在参加你妈的灵堂所以说一直司马脸，而你爸爸却在旁边喝酒庆祝***了，行了吧。\n***，像些弱智，不会发弹幕看***的直播啊你看，真的是，\n说我膨胀，求求你们不要说我是带明星了，我觉得你们才是带明星，\n你们这些水友嗨粉，你们是水明星，你们是嗨明星，你们才是明星，\n我是个催子明星，我天天被骂我还明星，你们有看过明星一个月3500块钱吗？\n有吗？有这种明星吗？有个鸡儿有，\n哎，嗯横，不要在这扣b，啊，滚出去，抠b，抠催子b，回去***的b\n，啊嗯，我是大明星，***房租都要交不起我还大明星，\n吃饭都成问题，你见过吃饭成问题的大明星吗？\n人家无心印来找我，我连一顿相应的饭都还没请吃过，\n说起来还真有点扎心，无心印别人千里迢迢的赶过来，结果请不了别人吃饭，因为没钱。\n大明星，我大个**，我巴不得我是***，\n我大明星。老子把****扣烂，老子，老子要把蜡烛皱到****里去，\n给你妈烧成你妈琥珀批，是不***，\n本来其实我这个人是个非常儒雅随和的一个人，我不喜欢骂脏话，但是你们是经常在嘴臭对不对，\n这个有一讲一，(点击左侧录制按钮即可开始录制本场比赛，)\n我其实更你们我觉得我们是一个很和谐有很和谐的关系，我们不会说什么的，\n但你们这些人经常乱骂，瞎**骂，不可取，有失公正，\n妈只知道骂我，你们也去骂骂其他人吧，\n送子，送发飞机可以给微信吗？不可以，送十个吧，\n洗，啊横，我私底下是很儒雅呀，你以为这么多女生女粉丝喜欢是因为什么呀，你以为这张脸吗？\n我自己心里没点b数吗？当什么呀，还不是因为我儒雅，\n你把你闪现给我交了，****，这武器必死。\n(lol打斗中，敌军还有三十秒到达战场，闪现声，控制自己，掌控敌人)\n谢谢时间，哦，谢谢时间是深海送得，哎呀，深海哥，你终于回来了，好久没看到你啦，谢谢深海，送得20个飞机，谢谢，啊谢谢，很久没看到过深海了，很久没看到了，\n你在在那那个涩你妈司马脸的滚出去啊，我都说了***了，你还在这看直播，不回去看 看你妈的灵堂摆没摆好？\n***了，真的是。横，说中痛处就气急败坏，其实还是一条懒狗，哎，好好好，你觉得是那就是，不狡辩。" ); 
	}
}
public class FinalKeyWords {
	public static void main(String[] args) {
		SunXiaoChuan mata=new SunXiaoChuan("mata川","nmsl");
		mata.say();
		mata.beiShengJing();
	}
}
